<?php
//1. Дано число $num = 800. Делите его на 2 столько раз, пока результат деления не станет меньше 50.
//Какое число получится? Посчитайте количество итераций,
//необходимых для этого (итерация - это проход цикла).
//Решите задачу сначала через цикл while, а потом через цикл for.
$num = 800;
$count;
while($num >= 50){
    $num = $num / 2;
    $count++;
    var_dump($num);
    var_dump('Всего итераций ' . $count);
};
//2. ---- в соседней папке 'goods'

//3. Создать массив из дней недели. С помощью цикла foreach выведите все дни недели,
// а текущий день выведите жирным. Текущий день можно получить с помощью функции date.
// Название дней выводить по-русски.
$days = [
    'Mon' => 'понедельник',
    'Tue' => 'вторник',
    'Wed' => 'среда',
    'Thu' => 'четверг',
    'Fri' => 'пятница',
    'Sat' => 'суббота',
    'Sun' => 'воскресенье'
];
$today = date('D');
foreach ($days as $key => $day){
    if($key == $today){
        $day[$key] = "<b> . $day . </b>";//почти получилось... проблема в кавычках?
    }
    echo  $day . "<br>";
};
//4. Отсортировать массив, который находится в файле lesson2/tasks.php, по 'price'.
//При решении использовать функции для работы с массивами.
$arr = [
    '1'=> [
        'price' => 10,
        'count' => 2
    ],
    '2'=> [
        'price' => 5,
        'count' => 5
    ],
    '3'=> [
        'price' => 8,
        'count' => 5
    ],
    '4'=> [
        'price' => 12,
        'count' => 4
    ],
    '5'=> [
        'price' => 8,
        'count' => 4
    ],
];
//еще не сделала

